ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_КорректировкаПробегов/УТЗ_ПЛ_КорректировкаПробегов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УТЗ_ПЛ_КорректировкаПробегов</name>
  <registerRecords>AccumulationRegister.УТЗ_ПЛ_ПробегАвтотранспорта</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокАвтотранспортаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАвтотранспорта</name>
    <attributes>
      <name>Автотранспорт</name>
      <type>
        <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.УТЗ_ПЛ_ВидыДвиженийКорректировок</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегТекущий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегСкорректированный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/AccumulationRegisters/УТЗ_ПЛ_ПробегАвтотранспорта/УТЗ_ПЛ_ПробегАвтотранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УТЗ_ПЛ_ПробегАвтотранспорта</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Автотранспорт</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Enums/УТЗ_ПЛ_ВидыДвиженийКорректировок/УТЗ_ПЛ_ВидыДвиженийКорректировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УТЗ_ПЛ_ВидыДвиженийКорректировок</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_КорректировкаПробегов/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.УТЗ_ПЛ_ПробегАвтотранспорта.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписокАвтотранспорта Из СписокАвтотранспорта Цикл
		Движение = Движения.УТЗ_ПЛ_ПробегАвтотранспорта.Добавить();
		Если ТекСтрокаСписокАвтотранспорта.ВидДвижения = Перечисления.УТЗ_ПЛ_ВидыДвиженийКорректировок.Приход Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;	
		ИначеЕсли ТекСтрокаСписокАвтотранспорта.ВидДвижения = Перечисления.УТЗ_ПЛ_ВидыДвиженийКорректировок.Расход Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
		
		Движение.Период = Дата;
		Движение.Автотранспорт = ТекСтрокаСписокАвтотранспорта.Автотранспорт;
		Движение.Количество = ТекСтрокаСписокАвтотранспорта.Количество;
		Движение.Ответственный = Ответственный;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МассивАвтотранспорта = СписокАвтотранспорта.ВыгрузитьКолонку("Автотранспорт");
	МассивБезДубликатов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивАвтотранспорта);
	СписокАвтотранспортаСтрокой = СтрСоединить(МассивБезДубликатов, ", ");
	
КонецПроцедуры



#КонецОбласти
